EmbeddedSystemClass/Mego-Arduino/boards.txt
menu.BoardModel=Model
menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.FlashSize=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.ESPModule=Module
menu.Debug=Debug port
menu.DebugLevel=Debug Level
menu.LwIPVariant=lwIP Variant
menu.led=Builtin Led
menu.FlashErase=Erase Flash

##############################################################
megoespview.name=Mego
megoespview.build.board=ESP8266_NODEMCU
megoespview.build.variant=espview
megoespview.upload.tool=esptool
megoespview.upload.maximum_data_size=81920
megoespview.upload.wait_for_upload_port=true
megoespview.upload.erase_cmd=
megoespview.serial.disableDTR=true
megoespview.serial.disableRTS=true
megoespview.build.mcu=esp8266
megoespview.build.core=esp8266
megoespview.build.spiffs_pagesize=256
megoespview.build.debug_port=
megoespview.build.debug_level=
megoespview.build.f_cpu=160000000L
megoespview.menu.CpuFrequency.80=80 MHz
megoespview.menu.CpuFrequency.80.build.f_cpu=80000000L
megoespview.menu.CpuFrequency.160=160 MHz
megoespview.menu.CpuFrequency.160.build.f_cpu=160000000L
megoespview.upload.resetmethod=nodemcu
megoespview.build.flash_mode=dio
megoespview.build.flash_freq=40
megoespview.menu.FlashSize.4M1M=4M (1M SPIFFS)
megoespview.menu.FlashSize.4M1M.build.flash_size=4M
megoespview.menu.FlashSize.4M1M.build.flash_size_bytes=0x400000
megoespview.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
megoespview.menu.FlashSize.4M1M.build.spiffs_pagesize=256
megoespview.menu.FlashSize.4M1M.upload.maximum_size=1044464
megoespview.menu.FlashSize.4M1M.build.rfcal_addr=0x3FC000
megoespview.menu.FlashSize.4M1M.build.spiffs_start=0x300000
megoespview.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
megoespview.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
megoespview.menu.FlashSize.4M3M=4M (3M SPIFFS)
megoespview.menu.FlashSize.4M3M.build.flash_size=4M
megoespview.menu.FlashSize.4M3M.build.flash_size_bytes=0x400000
megoespview.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
megoespview.menu.FlashSize.4M3M.build.spiffs_pagesize=256
megoespview.menu.FlashSize.4M3M.upload.maximum_size=1044464
megoespview.menu.FlashSize.4M3M.build.rfcal_addr=0x3FC000
megoespview.menu.FlashSize.4M3M.build.spiffs_start=0x100000
megoespview.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
megoespview.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
megoespview.menu.LwIPVariant.v2mss536=v2 Lower Memory
megoespview.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
megoespview.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
megoespview.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
megoespview.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
megoespview.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
megoespview.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
megoespview.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
megoespview.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
megoespview.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
megoespview.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
megoespview.menu.LwIPVariant.OpenSource=v1.4 Compile from source
megoespview.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
megoespview.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
megoespview.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
megoespview.menu.Debug.Disabled=Disabled
megoespview.menu.Debug.Disabled.build.debug_port=
megoespview.menu.Debug.Serial=Serial
megoespview.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
megoespview.menu.Debug.Serial1=Serial1
megoespview.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
megoespview.menu.DebugLevel.None____=None
megoespview.menu.DebugLevel.None____.build.debug_level=
megoespview.menu.DebugLevel.SSL=SSL
megoespview.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
megoespview.menu.DebugLevel.TLS_MEM=TLS_MEM
megoespview.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
megoespview.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
megoespview.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
megoespview.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
megoespview.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
megoespview.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
megoespview.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
megoespview.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
megoespview.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
megoespview.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
megoespview.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
megoespview.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
megoespview.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
megoespview.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
megoespview.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
megoespview.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
megoespview.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
megoespview.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
megoespview.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
megoespview.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
megoespview.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
megoespview.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
megoespview.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
megoespview.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
megoespview.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
megoespview.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
megoespview.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
megoespview.menu.DebugLevel.CORE=CORE
megoespview.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
megoespview.menu.DebugLevel.WIFI=WIFI
megoespview.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
megoespview.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
megoespview.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
megoespview.menu.DebugLevel.UPDATER=UPDATER
megoespview.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
megoespview.menu.DebugLevel.OTA=OTA
megoespview.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
megoespview.menu.DebugLevel.OOM=OOM
megoespview.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
megoespview.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
megoespview.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
megoespview.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
megoespview.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
megoespview.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
megoespview.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
megoespview.menu.FlashErase.none=Only Sketch
megoespview.menu.FlashErase.none.upload.erase_cmd=
megoespview.menu.FlashErase.sdk=Sketch + WiFi Settings
megoespview.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
megoespview.menu.FlashErase.all=All Flash Contents
megoespview.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
megoespview.menu.UploadSpeed.115200=115200
megoespview.menu.UploadSpeed.115200.upload.speed=115200
megoespview.menu.UploadSpeed.9600=9600
megoespview.menu.UploadSpeed.9600.upload.speed=9600
megoespview.menu.UploadSpeed.57600=57600
megoespview.menu.UploadSpeed.57600.upload.speed=57600
megoespview.menu.UploadSpeed.230400.linux=230400
megoespview.menu.UploadSpeed.230400.macosx=230400
megoespview.menu.UploadSpeed.230400.upload.speed=230400
megoespview.menu.UploadSpeed.256000.windows=256000
megoespview.menu.UploadSpeed.256000.upload.speed=256000
megoespview.menu.UploadSpeed.460800.linux=460800
megoespview.menu.UploadSpeed.460800.macosx=460800
megoespview.menu.UploadSpeed.460800.upload.speed=460800
megoespview.menu.UploadSpeed.512000.windows=512000
megoespview.menu.UploadSpeed.512000.upload.speed=512000
megoespview.menu.UploadSpeed.921600=921600
megoespview.menu.UploadSpeed.921600.upload.speed=921600
